
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	// *1 саженей в метры(1 сажень равна 2, 1366 м)
	// *2 из дюймов в сантиметры(1 дюйм равен 2, 5 см)
	// *3 футов в метры(1 фут равен 0, 3048 м)
	// *4 драхм в граммы(1 драхма равна 3, 7325 г)
	// *5 унций в граммы(1 унция равна 29, 86 г)
	// *6 фунтов в килограммы(1 фунт равен 0, 40951 кг)
	// *7 аршинов в метры(1 аршин равен 0, 7112 м)
	// *8 золотников в граммы(1 золотник равен 4, 2657 г)
	// *9 дюймов в миллиметры(1 дюйм равен 25, 3995 мм)

	cout << "введите номер команды";
	int n;
	cin >> n;

	cout << "введите величину";
	double x;
	cin >> x;

	double arr[9] = { 2.1366, 2.5, 0.3048, 3.7325, 29.86, 0.40951, 0.7112, 4.2657, 25.3995 };

	for (int i = 0; i < 10; i++) {
		if ((n - 1) == i)
			x *= arr[i];
	}

	cout << x << endl;



}